Repository: ajmadsen/monasca-ui
Catalog: monitoring/locale/*/LC_MESSAGES/django.po
Languages: ru

source: The Name field is used to identify the alarm definition.
ru: Поле Имя используется для определения сигнала тревоги

source: Each alarm definition is defined by its expression composed out of: mathematical function, metric, threshold and comparator for metric's value and the threshold. Additionally it is possible to narrow evaluation of the alarm to certain entities by choosing their dimensions. The deterministic alarms never enter UNDETERMINED state. Use them for metrics that are received sporadically.
ru: Каждое определение сигнала тревоги задаётся выражением, состоящим из: математической функции, метрики, пороговых значений и оператора сравнения значений метрик и пороговых значений. Так же возможно сузить область действия сигнала тревоги, выбрав их размерность. Детерминированные сигналы тревоги никогда не переходят в состояние НЕ ОПРЕДЕЛЁН. Используйте их для метрик, значения которых определяются нерегулярно.

source: If for some transitions notifications should not be sent they can be disabled.
ru: Если для некоторых изменений статуса уведомления не должны отправляться, то они могут быть отключены.

source: The Description field can be used to describe alarm definition's purpose.
ru: Поле Описание может использоваться для описания цели определения сигнала тревоги.

source: The Name field is used to identify the alarm definition.
ru: Поле Имя используется для определения сигнала тревоги.

source: The Notifications field contains the list of Notifications that should be sent when transitioning to another state.
ru: Поле Уведомления содержит список уведомлений, которые должны отправляться, при изменении статуса.

source: The Severity field allows to specify the importance of alarm definition.
ru: Полу Важность позволяет задать значительность события сигнала тревоги.

source: A non-zero value in the period field indicates how frequently a notification should be resent (only valid for webhook urls).
ru: Ненулевое значение в поле периода задаёт частоту повторной отправки уведомления (только для webhook'ов).

source: The Address field indicates the email address, URL, or PagerDuty service key to be notified.
ru: Поле Адрес содержит email, URL, или ключ сервиса PagerDuty, куда будет отправлено уведомление.

source: The Expression field which if true, triggers a notification to be sent. See <a href="https://github.com/openstack/monasca-api/blob/master/docs/monasca-api-spec.md#alarm-definition-expressions" target="_blank">Alarm Expressions</a> for how to write an expression.
ru: Если вычисление в поле Выражение даёт результатом true, то отправляется уведомление. См. <a href="https://github.com/openstack/monasca-api/blob/master/docs/monasca-api-spec.md#alarm-definition-expressions" target="_blank">Выражения сигналов тревоги</a> для информации о том, как писать выражения.

source: The Name field is used to identify the notification method.
ru: Поле Имя используется для идентификации метода уведомления.

source: The Notifications field contains the list of Notifications that should be sent when transitioning to another ALARM state.
ru: Поле Уведомления содержит список уведомлений, которые должны быть отправлены, при изменении статуса сигнала тревоги.

source: The Type field indicates how the notification is sent when an alarm is triggered.
ru: Поле Тип определяет, как отправляется уведомление при срабатывании сигнала тревоги.

source: + Add more
ru: + Добавить ещё

source: ---Please select---
ru: ---Пожалуйста, выберите---

source: A description of an alarm.
ru: Описание сигнала тревоги.

source: A descriptive name of the notification method.
ru: Описательное имя метода уведомления.

source: Add
ru: Добавить

source: Add a match by
ru: Добавить фильтрацию по

source: Address
ru: Адрес

source: Address must contain a valid URL address.
ru: Поле должно содержать корректный URL.

source: Address must contain a valid email address.
ru: Поле должно содержать корректный email адрес.

source: Alarm
ru: Сигнал тревоги

source: Alarm Actions
ru: Действия по сигналу тревоги

source: Alarm Definition Details
ru: Детали определения сигнала тревоги

source: Alarm Definitions
ru: Определение сигнала тревоги

source: Alarm Details
ru: Подробности сигнала тревоги

source: Alarm History
ru: История сигнала тревоги

source: Alarm ID
ru: ID Сигнала тревоги

source: Alarm Id
ru: ID Сигнала тревоги

source: Alarm Metric Dimensions
ru: Размерность метрик сигнала тревоги

source: Alarm definition %s has been created
ru: Создано определение сигнала тревоги с именем %s

source: Alarm definition has been updated.
ru: Определение сигнала тревоги обновлено.

source: Alarm definition with %s name already exists
ru: Определение сигнала тревоги с именем %s уже существует

source: Alarm has been created successfully.
ru: Сигнал тревоги успешно создан.

source: Alarm has been edited successfully.
ru: Сигнал тревоги успешно изменён.

source: Alarms
ru: Сигналы тревоги

source: Alarms for
ru: Сигналы тревоги для

source: All Alarms
ru: Все сигналы тревоги

source: An alarm expression.
ru: Описание сигнала тревоги.

source: An unique name of the alarm.
ru: Уникальное имя сигнала тревоги.

source: Associated Metrics
ru: Связанные метрики

source: Browser local
ru: Локальный навигатор

source: Cancel
ru: Отмена

source: Close
ru: Закрыть

source: Could not retrieve alarm definitions
ru: Не удалось получить определения сигнала тревоги

source: Could not retrieve alarm for %s
ru: Не удалось получить сигнал тревоги для %s

source: Could not retrieve alarm history for %s
ru: Не удалось получить историю сигналов тревоги для %s

source: Could not retrieve alarms
ru: Не удалось получить сигналы тревоги

source: Could not retrieve notifications
ru: Не удалось получить уведомления

source: Create Alarm
ru: Создать сигнал тревоги

source: Create Alarm Definition
ru: Создать определение сигнала тревоги

source: Create Notification
ru: Создать уведомление

source: Create Notification Method
ru: Создать метод уведомления

source: Critical
ru: Критичность

source: Delete Alarm
ru: Удалить сигнал тревоги

source: Delete Alarm Definition
ru: Удалить определение сигнала тревоги

source: Delete Notification
ru: Удалить уведомление

source: Deleted Alarm
ru: Сигнал тревоги удалён

source: Deleted Alarm Definition
ru: Определение сигнала тревоги удалено

source: Deleted Notification
ru: Уведомление удалено

source: Description
ru: Описание

source: Details
ru: Подробности

source: Deterministic
ru: Определён

source: Dimension(s)
ru: Размерность(-и)

source: Edit Alarm
ru: Изменить сигнал тревоги

source: Edit Alarm Definition
ru: Изменить определение сигнала тревоги

source: Edit Alarm Definitions
ru: Изменить определения сигнала тревоги

source: Edit Notification
ru: Изменить уведомление

source: Expression
ru: Выражение

source: Failed to present alarm history
ru: Не удалось отобразить историю сигналов тревоги

source: Failed to validate name
ru: Проверка имени не выполнена

source: Filter Alarms
ru: Фильтровать сигналы тревоги

source: Graph Metric
ru: Построить график по метрикам

source: High
ru: Низкий

source: Info
ru: Информация

source: Key
ru: Ключ

source: Low
ru: Высокий

source: Match by
ru: Фильтровать по

source: Measurements for Alarms
ru: Измерения для сигналов тревоги

source: Medium
ru: Средний

source: Metric Dimensions
ru: Размерность метрики

source: Metric Name
ru: Имя метрики

source: Metric Names
ru: Имя метрики

source: Monitoring
ru: Мониторинг

source: Name
ru: Имя

source: New State
ru: Новый статус

source: Next Page
ru: Следующая Страница

source: No notifications available.
ru: Нет доступных уведомлений.

source: None
ru: Нет

source: Notification %s has already been deleted.
ru: Уведомление %s уже было удалено.

source: Notification Method Details
ru: Подробности метода уведомления

source: Notification has been edited successfully.
ru: Уведомление успешно изменено.

source: Notification method has been created successfully.
ru: Метод уведомления успешно создан.

source: Notification methods. Notifications can be sent when an alarm state transition occurs.
ru: Методы уведомления. При изменении статуса тревоги могут отправляться уведомления.

source: Notifications
ru: Уведомления

source: Notifications Enabled
ru: Уведомления включены

source: OK
ru: ОК

source: OK Actions
ru: Действия по отмене тревоги

source: Old State
ru: Предыдущий статус

source: OpenStack Services
ru: Службы OpenStack

source: Overview
ru: Обзор

source: Period
ru: Период

source: Period must be zero except for type webhook.
ru: Для webhook'а период должен быть установлен в ноль.

source: Previous Page
ru: Предыдущая Страница

source: Reason
ru: Причина

source: Remove
ru: Удалить

source: Save
ru: Сохранить

source: Save Notification
ru: Сохранить уведомление

source: Select Notification
ru: Выбрать уведомление

source: Servers
ru: Серверы

source: Service :
ru: Служба :

source: Service Health
ru: Доступность сервиса

source: Severity
ru: Важность

source: Severity of an alarm. Must be either LOW, MEDIUM, HIGH or CRITICAL. Default is LOW.
ru: Важность сигнала тревоги. Должна быть установлена в один из вариантов: НИЗКАЯ, СРЕДНЯЯ, ВЫСОКАЯ или КРИТИЧНАЯ. По-умолчанию – НИЗКАЯ.

source: Show Alarm Definition
ru: Показать определение сигнала тревоги

source: Show History
ru: Показать историю

source: State
ru: Состояние

source: Status
ru: Статус

source: Submit
ru: Отправить

source: The email/url address to notify.
ru: E-mail адрес или URL для доставки уведомления.

source: The metric dimensions used to create unique alarms.
ru: Размерность метрик, используемых для создания индивидуальных сигналов тревоги.

source: The notification period.
ru: Период уведомления.

source: The type of notification method (i.e. email).
ru: Тип метода уведомления (напр. email).

source: Timestamp
ru: Системное время

source: Type
ru: Тип

source: Unable to create alarm definition %s
ru: Не удалось создать определение сигнала тревоги с именем %s

source: Unable to create the alarm: %s
ru: Не удалось создать сигнал тревоги: %s

source: Unable to create the notification method: %s
ru: Не удалось создать метод уведомления: %s

source: Unable to delete notification: %s
ru: Не удалось удалить уведомление: %s

source: Unable to edit the alarm: %s
ru: Не удалось изменить сигнал тревоги: %s

source: Unable to edit the notification: %s
ru: Не удалось изменить уведомление: %s

source: Unable to list alarms: %s
ru: Не удалось получить сигналы тревоги: %s

source: Unable to retrieve alarm details.
ru: Не удалось получить подробности сигнала тревоги

source: Unable to retrieve metrics
ru: Не удалось получить метрики

source: Unable to retrieve notification details.
ru: Не удалось получить подробности уведомления

source: Unable to retrieve notifications: %s
ru: Невозможно получить уведомления: %s

source: Undetermined
ru: Не определён

source: Undetermined Actions
ru: Действия не определены

source: Unknown name
ru: Неизвестное имя

source: User %s does not have sufficient privileges to access Kibana
ru: Пользователь %s не имеет достаточных привилегий для доступа в Kibana

source: Value
ru: Значение
